Revit 2027 API
ParameterTypeId.ViewportDetailNumber Property
 "Detail Number"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewportDetailNumber { get; }
Public Shared ReadOnly Property ViewportDetailNumber As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewportDetailNumber {
	ForgeTypeId^ get ();
}
static member ViewportDetailNumber : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace